app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("image", "video", "title", "star", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "image" = ?, "title" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["image", "python.jpeg"], ["title", "Python за 1 час для новичков"], ["updated_at", "2022-05-21 18:32:32.829516"], ["id", 1]]